In [1]:
import pandas as pd

In [2]:
purchase = pd.read_csv('lv2-2305-5.csv')

In [3]:
purchase.shape

(30308, 7)

In [4]:
purchase.head()

   USER_ID  PRD_CAT     PRD_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT
0  1001395        1  P00270942      M   26-35           1    11535
1  1001004        3  P00004842      M   26-35           0     5724
2  1000819        1  P00036842      M   36-45           0    11787
3  1001611        1  P00127742      M   26-35           0     8125
4  1000438        1  P00129342      M   18-25           0    19096

# Q1

### 1-1

In [5]:
df1 = purchase.pivot_table(values=['PUR_AMT'], columns=['PRD_CAT'], index=['USER_ID', 'MARITAL_YN'], aggfunc='sum', fill_value=0).reset_index()

In [6]:
df1.head()

         USER_ID MARITAL_YN PUR_AMT
PRD_CAT                           1      2      3
0        1000003          0  162439  29054  10906
1        1000004          1  205987      0      0
2        1000005          1  104097  12841  10851
3        1000006          0   93457  35997  59314
4        1000007          1  158969      0      0

In [7]:
df1.columns = ['USER_ID', 'MARITAL_YN', 'CAT1_AMT', 'CAT2_AMT','CAT3_AMT']

In [8]:
df1.head()

   USER_ID  MARITAL_YN  CAT1_AMT  CAT2_AMT  CAT3_AMT
0  1000003           0    162439     29054     10906
1  1000004           1    205987         0         0
2  1000005           1    104097     12841     10851
3  1000006           0     93457     35997     59314
4  1000007           1    158969         0         0

### 1-2

In [9]:
from scipy.stats import pearsonr

In [10]:
df1[df1['MARITAL_YN'] == 0].loc[:, ['CAT1_AMT', 'CAT2_AMT','CAT3_AMT']].corr()

          CAT1_AMT  CAT2_AMT  CAT3_AMT
CAT1_AMT  1.000000  0.728646  0.553856
CAT2_AMT  0.728646  1.000000  0.650382
CAT3_AMT  0.553856  0.650382  1.000000

In [11]:
df1[df1['MARITAL_YN'] == 1].loc[:, ['CAT1_AMT', 'CAT2_AMT','CAT3_AMT']].corr()

          CAT1_AMT  CAT2_AMT  CAT3_AMT
CAT1_AMT  1.000000  0.695264  0.509462
CAT2_AMT  0.695264  1.000000  0.709962
CAT3_AMT  0.509462  0.709962  1.000000

### 1-3

In [12]:
A = 0.728646
B = 0.509462
C = abs(A - B)

### Q1 Answer

In [13]:
round(C, 3)

0.219

# Q2

### 2-1

In [14]:
purchase.head()

   USER_ID  PRD_CAT     PRD_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT
0  1001395        1  P00270942      M   26-35           1    11535
1  1001004        3  P00004842      M   26-35           0     5724
2  1000819        1  P00036842      M   36-45           0    11787
3  1001611        1  P00127742      M   26-35           0     8125
4  1000438        1  P00129342      M   18-25           0    19096

In [15]:
df2 = purchase.pivot_table(values=['PUR_AMT'], columns=['AGE_GRP'], index=['PRD_ID'], aggfunc='sum', fill_value=0).reset_index()

In [16]:
df2.head()

            PRD_ID PUR_AMT
AGE_GRP              18-25   26-35   36-45   46-50  51-55
0        P00000142  532314  857816  410458  110167  78328
1        P00000242  163997  254667  124015   88333  22685
2        P00000642  370517  574747  175068   47192  39675
3        P00000842   26105       0       0       0      0
4        P00000942   64393   51194   50653       0      0

In [17]:
df2.columns = ['PRD_ID', 'AGE1_AMT', 'AGE2_AMT', 'AGE3_AMT', 'AGE4_AMT', 'AGE5_AMT']

In [18]:
df2.head()

      PRD_ID  AGE1_AMT  AGE2_AMT  AGE3_AMT  AGE4_AMT  AGE5_AMT
0  P00000142    532314    857816    410458    110167     78328
1  P00000242    163997    254667    124015     88333     22685
2  P00000642    370517    574747    175068     47192     39675
3  P00000842     26105         0         0         0         0
4  P00000942     64393     51194     50653         0         0

### 2-2

In [19]:
from sklearn.preprocessing import StandardScaler

In [20]:
for i in range(1,6):
    df2['AGE' + str(i) + '_AMT_Z'] = StandardScaler().fit_transform(X=df2[['AGE' + str(i) + '_AMT']])

In [21]:
df2.head()

,PRD_ID,AGE1_AMT,AGE2_AMT,AGE3_AMT,AGE4_AMT,AGE5_AMT,AGE1_AMT_Z,AGE2_AMT_Z,AGE3_AMT_Z,AGE4_AMT_Z,AGE5_AMT_Z
0,P00000142,532314,857816,410458,110167,78328,2.244283,2.134885,2.046374,1.206063,0.793814
1,P00000242,163997,254667,124015,88333,22685,0.166760,0.082540,0.106051,0.840197,-0.218397
2,P00000642,370517,574747,175068,47192,39675,1.331654,1.171681,0.451877,0.150810,0.090671
3,P00000842,26105,0,0,0,0,-0.611031,-0.784019,-0.734008,-0.639972,-0.631063
4,P00000942,64393,51194,50653,0,0,-0.395064,-0.609820,-0.390892,-0.639972,-0.631063

### 2-3

In [22]:
from sklearn.cluster import KMeans

In [23]:
model = KMeans(n_clusters=3, init='random', n_init=50,  random_state=1234).fit(X=df2.iloc[:, -5:])

In [24]:
pred = model.predict(X=df2.iloc[:, -5:])

In [25]:
pred

array([2, 1, 2, 1, 1, 2, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 0, 2, 2, 1, 1, 1, 2, 1, 2, 1, 2, 1, 1, 1, 2, 2, 1, 0,
       1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 0, 1, 1, 1, 1, 2,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 2,
       0, 2, 2, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 2, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 1, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1, 2, 2,
       2, 1, 1, 1, 0, 0, 0, 0, 2, 2, 1, 0, 0, 2, 1, 1, 2, 0, 2, 1, 2, 0,
       2, 1, 2, 1, 2, 1, 1, 2, 1, 2, 2, 0, 1, 2, 2, 1, 2, 1, 2, 2, 2, 1,
       2, 2, 2, 2, 1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 2, 2, 1, 1, 1, 2, 0, 1, 2, 1, 1, 1,
       1, 2, 1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1, 2, 1, 2, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 2, 2, 1, 2, 2, 2, 1,
       2, 2, 1, 2, 2, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1, 2,
       2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 2, 1, 2, 2,
       1, 1, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1,
       1, 1, 2, 2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 1, 1, 1, 1, 1, 1, 2, 1, 0, 2, 2, 1, 1, 2, 1, 2, 2, 2, 1, 1, 1,
       2, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2,
       1, 1, 1, 2, 2, 1, 1, 1, 2, 1, 1, 1, 1, 2, 0, 1, 2, 2, 2, 2, 1, 1,
       1, 1, 2, 1, 2, 1, 2, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2,
       1, 2, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 1, 1,
       0, 1, 1, 1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2,
       2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 1, 2, 1, 2, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1,
       1, 1, 1], dtype=int32)

In [26]:
df2['LABEL'] = pred

### 2-4

In [27]:
df2.head()

,PRD_ID,AGE1_AMT,AGE2_AMT,AGE3_AMT,AGE4_AMT,AGE5_AMT,AGE1_AMT_Z,AGE2_AMT_Z,AGE3_AMT_Z,AGE4_AMT_Z,AGE5_AMT_Z,LABEL
0,P00000142,532314,857816,410458,110167,78328,2.244283,2.134885,2.046374,1.206063,0.793814,2
1,P00000242,163997,254667,124015,88333,22685,0.166760,0.082540,0.106051,0.840197,-0.218397,1
2,P00000642,370517,574747,175068,47192,39675,1.331654,1.171681,0.451877,0.150810,0.090671,2
3,P00000842,26105,0,0,0,0,-0.611031,-0.784019,-0.734008,-0.639972,-0.631063,1
4,P00000942,64393,51194,50653,0,0,-0.395064,-0.609820,-0.390892,-0.639972,-0.631063,1

In [28]:
df2.groupby('LABEL')['AGE3_AMT'].mean()

LABEL
0    646635.166667
1     45823.413084
2    247128.722973
Name: AGE3_AMT, dtype: float64

### Q2 Answer

In [29]:
round(45823.413084)

45823

# Q3

### 3-1

In [30]:
purchase.head()

   USER_ID  PRD_CAT     PRD_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT
0  1001395        1  P00270942      M   26-35           1    11535
1  1001004        3  P00004842      M   26-35           0     5724
2  1000819        1  P00036842      M   36-45           0    11787
3  1001611        1  P00127742      M   26-35           0     8125
4  1000438        1  P00129342      M   18-25           0    19096

In [31]:
df3 = purchase.pivot_table(values=['PUR_AMT'], index=['USER_ID', 'GENDER', 'AGE_GRP', 'MARITAL_YN'], aggfunc='sum', fill_value=0).reset_index()
df3.head()

   USER_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT
0  1000003      M   26-35           0   202399
1  1000004      M   46-50           1   205987
2  1000005      M   26-35           1   127789
3  1000006      F   51-55           0   188768
4  1000007      M   36-45           1   158969

In [32]:
df3_detail = purchase.pivot_table(values=['PUR_AMT'], columns=['PRD_CAT'], index=['USER_ID'], aggfunc='sum', fill_value=0).reset_index()

In [33]:
df3_detail.head()

         USER_ID PUR_AMT
PRD_CAT                1      2      3
0        1000003  162439  29054  10906
1        1000004  205987      0      0
2        1000005  104097  12841  10851
3        1000006   93457  35997  59314
4        1000007  158969      0      0

In [34]:
df3_detail.columns = ['USER_ID', '1', '2', '3']

In [35]:
df3_detail.head()

   USER_ID       1      2      3
0  1000003  162439  29054  10906
1  1000004  205987      0      0
2  1000005  104097  12841  10851
3  1000006   93457  35997  59314
4  1000007  158969      0      0

In [36]:
df3_detail['MAX'] = df3_detail.loc[:, ['1', '2', '3']].idxmax(axis=1)

In [37]:
df3_detail.head()

   USER_ID       1      2      3 MAX
0  1000003  162439  29054  10906   1
1  1000004  205987      0      0   1
2  1000005  104097  12841  10851   1
3  1000006   93457  35997  59314   1
4  1000007  158969      0      0   1

In [38]:
df3['PRF_CAT'] = df3_detail['MAX']

In [39]:
df3.head(10)

   USER_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT PRF_CAT
0  1000003      M   26-35           0   202399       1
1  1000004      M   46-50           1   205987       1
2  1000005      M   26-35           1   127789       1
3  1000006      F   51-55           0   188768       1
4  1000007      M   36-45           1   158969       1
5  1000009      M   26-35           0   100147       1
6  1000011      F   26-35           0    74805       1
7  1000012      M   26-35           0    59156       1
8  1000013      M   46-50           1   410999       1
9  1000014      M   36-45           0    38191       1

In [40]:
df3.tail()

      USER_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT PRF_CAT
1276  1001794      M   26-35           0   658341       1
1277  1001795      M   18-25           0    38110       1
1278  1001796      M   51-55           1    34467       1
1279  1001797      M   36-45           0   171241       1
1280  1001798      M   46-50           1    84234       1

In [41]:
df3['PRF_CAT'].value_counts()

PRF_CAT
1    1194
3      56
2      31
Name: count, dtype: int64

### 3-2

In [44]:
q2 = df3['PUR_AMT'].quantile(0.5)
q2

np.float64(160782.0)

In [45]:
q3 = df3['PUR_AMT'].quantile(0.75)
q3

np.float64(411061.0)

In [46]:
df3 = df3[(df3['PUR_AMT'] >= q2) & (df3['PUR_AMT'] <= q3)]

In [47]:
df3.shape

(321, 6)

In [53]:
df3 = df3.reset_index(drop=True)
df3.head()

   USER_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT PRF_CAT
0  1000003      M   26-35           0   202399       1
1  1000004      M   46-50           1   205987       1
2  1000006      F   51-55           0   188768       1
3  1000013      M   46-50           1   410999       1
4  1000015      M   26-35           0   242334       1

### 3-3

In [69]:
df3.loc[:, ['GENDER_F', 'GENDER_M']] = pd.get_dummies(data=df3['GENDER'], dtype='int', prefix='GENDER')
df3.head()

   USER_ID GENDER AGE_GRP  MARITAL_YN  PUR_AMT PRF_CAT  GENDER_F  GENDER_M
0  1000003      M   26-35           0   202399       1         0         1
1  1000004      M   46-50           1   205987       1         0         1
2  1000006      F   51-55           0   188768       1         1         0
3  1000013      M   46-50           1   410999       1         0         1
4  1000015      M   26-35           0   242334       1         0         1

In [72]:
df3 = pd.concat([df3, pd.get_dummies(data=df3['AGE_GRP'], dtype='int', prefix='AGE_GRP')], axis=1)

In [73]:
df3 = pd.concat([df3, pd.get_dummies(data=df3['MARITAL_YN'], dtype='int', prefix='MARITAL_YN')], axis=1)

In [74]:
df3 = pd.concat([df3, pd.get_dummies(data=df3['PRF_CAT'], dtype='int', prefix='PRF_CAT')], axis=1)

In [75]:
df3.shape

(321, 17)

### 3-4

In [76]:
df3 = df3.sort_values(by='USER_ID')

In [77]:
df3.head()

,USER_ID,GENDER,AGE_GRP,MARITAL_YN,PUR_AMT,PRF_CAT,GENDER_F,GENDER_M,AGE_GRP_18-25,AGE_GRP_26-35,AGE_GRP_36-45,AGE_GRP_46-50,AGE_GRP_51-55,MARITAL_YN_0,MARITAL_YN_1,PRF_CAT_1,PRF_CAT_3
0,1000003,M,26-35,0,202399,1,0,1,0,1,0,0,0,1,0,1,0
1,1000004,M,46-50,1,205987,1,0,1,0,0,0,1,0,0,1,1,0
2,1000006,F,51-55,0,188768,1,1,0,0,0,0,0,1,1,0,1,0
3,1000013,M,46-50,1,410999,1,0,1,0,0,0,1,0,0,1,1,0
4,1000015,M,26-35,0,242334,1,0,1,0,1,0,0,0,1,0,1,0

In [79]:
df3.tail()

,USER_ID,GENDER,AGE_GRP,MARITAL_YN,PUR_AMT,PRF_CAT,GENDER_F,GENDER_M,AGE_GRP_18-25,AGE_GRP_26-35,AGE_GRP_36-45,AGE_GRP_46-50,AGE_GRP_51-55,MARITAL_YN_0,MARITAL_YN_1,PRF_CAT_1,PRF_CAT_3
316,1001762,M,26-35,1,299418,1,0,1,0,1,0,0,0,0,1,1,0
317,1001770,M,36-45,0,171223,1,0,1,0,0,1,0,0,1,0,1,0
318,1001775,M,26-35,1,253198,1,0,1,0,1,0,0,0,0,1,1,0
319,1001781,F,36-45,0,169703,1,1,0,0,0,1,0,0,1,0,1,0
320,1001797,M,36-45,0,171241,1,0,1,0,0,1,0,0,1,0,1,0

In [80]:
train3 = df3[df3['USER_ID'] % 4 != 0]
test3 = df3[df3['USER_ID'] % 4 == 0]

In [81]:
train3.shape, test3.shape

((248, 17), (73, 17))

### 3-5

In [82]:
from sklearn.tree import DecisionTreeRegressor

In [83]:
model = DecisionTreeRegressor(random_state=1234).fit(X=train3.iloc[:, -11:], y=train3['PUR_AMT'])

### 3-6

In [84]:
pred = model.predict(X=test3.iloc[:, -11:])

In [85]:
from sklearn.metrics import mean_absolute_percentage_error

In [87]:
mean_absolute_percentage_error(y_true=test3['PUR_AMT'], y_pred=pred)

0.26608653966406576

### Q3 Answer

In [89]:
round(mean_absolute_percentage_error(y_true=test3['PUR_AMT'], y_pred=pred) * 100, 2)

26.61

In [91]:
import numpy as np

In [92]:
np.mean(abs((pred - test3['PUR_AMT'])/test3['PUR_AMT']))*100

np.float64(26.608653966406575)